import React from "react";

export const initialState = {
        title: ["Москва для жизни и для развлечений", "Для жизни", "Для развлечений", "Рейтинг райнов Москвы по удобству жизни и выбору развлечений"],
        text: [
            "Москва - огромный город для жизни и для развлечений. Только подумать, 12.5 миллионов совершенно разных людей, чьи вкусы и потребности уникальны.",
            "Опираясь на отзывы людей из социальных сетей можно разделить районы города на три категории:"
        ],
        districts: [
            {
                dist: "Академический",
                place: [
                    {
                        place: "07",
                        text: "по удобству жизни"
                    },
                    {
                        place: "25",
                        text: "по удобству жизни"
                    }
                ],
                text: "“В принципе у нас есть чем заняться - и до музея, и до театра - пусть и не самого " +
                    "извествного - идти в среднем меьше 10 минут”",
                diagram: [60, 30, 10]
            },
            {
                dist: "Басманский",
                place: [
                    {
                        place: "09",
                        text: "по удобству жизни"
                    },
                    {
                        place: "23",
                        text: "по удобству жизни"
                    }
                ],
                text: "“В принципе у нас есть чем заняться - и до музея, и до театра - пусть и не самого " +
                    "извествного - идти в среднем меьше 10 минут”",
                diagram: [60, 30, 10]
            },

        ],

        options: [
            {
                buttonName: "Для жизни",
                buttonStatus: "active",
                tags: [
                    {
                        color: "#FC9801",
                        text: "Очень удобно для жизни"
                    },
                    {
                        color: "#FFE607",
                        text: "Удобно для жизни"
                    },
                    {
                        color: "#C4C4C4",
                        text: "Недостаточно инфраструктуры"
                    },
                ],
                points: [
                    {
                        latitude: 55.831903,
                        longitude: 37.411961,
                        text:"Здесь удобно",
                        color:"yellow"
                    },
                    {
                        latitude: 55.763338,
                        longitude: 37.565466,
                        text:"Здесь очень удобно",
                        color:"#FC9801"
                    },
                    {
                        latitude:  55.744522,
                        longitude: 37.616378,
                        text:"Здесь неудобно",
                        color:"gray"
                    }
                ]
            },
            {
                buttonName: "Для развлечений",
                buttonStatus: "",
                tags: [
                    {
                        color: "#FF3C1E",
                        text: "Культурные"
                    },
                    {
                        color: "#4574B2",
                        text: "Развлекательные"
                    },
                    {
                        color: "#8B5876",
                        text: "Культурно-развлекательные"
                    },
                    {
                        color: "#C4C4C4",
                        text: "Недостаточно мест для досуга и развлечений"
                    },
                ],
                points: [
                    {
                        latitude: 54.684758,
                        longitude: 37.738521,
                        text:"12312123",
                        color:"#0095b6"
                    },
                ]

            },
            {
                buttonName: "Для всего",
                buttonStatus: "",
                tags: [
                    {
                        color: "#7ABD9B",
                        text: "Очень удобно для жизни"
                    },
                    {
                        color: "#BF9DC5",
                        text: "Удобно для жизни"
                    },
                    {
                        color: "#8B5876",
                        text: "Недостаточно инфраструктуры"
                    },
                ],
                points: [
                    {
                        latitude: 54.684758,
                        longitude: 37.738521,
                        text:"12312123",
                        color:"#0095b6"
                    },
                ]
            }
        ],
    }
;
